# 车牌字符字典
PROVINCES = [
    "皖", "沪", "津", "渝", "冀", "晋", "蒙", "辽", "吉", "黑",
    "苏", "浙", "京", "闽", "赣", "鲁", "豫", "鄂", "湘", "粤",
    "桂", "琼", "川", "贵", "云", "藏", "陕", "甘", "青", "宁", "新"
]

WORDS = [
    "A", "B", "C", "D", "E", "F", "G", "H", "I",
    "J", "K", "L", "M", "N", "O",
    "P", "Q", "R", "S", "T", "U", "V",
    "W", "X", "Y", "Z", "0", "1", "2", "3", "4", "5",
    "6", "7", "8", "9"
]

SPECIALS = ["学", "警", "港", "澳", "挂", "使", "领", "临",
# "I", "O"
 ]

CHARS = PROVINCES + WORDS + SPECIALS + ['-']
CHARS_DICT = {char: i for i, char in enumerate(CHARS)}