#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Feb 20 13:49:26 2025

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/dilation.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/plate_find.v"
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/ratio_check.v"
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/roi_crop.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/char_proc.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/gamma_proc.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/gauss_filter.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/plate_box.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
add_design "E:/2_Demo/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/3_9_HDMI_IN_DDR3_sobel/HDMI_IN_DDR3_sobel/source/plate_box.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/erosion.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/color_find.v"
add_design "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/edge_find.v"
remove_design -force -verilog "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/char_proc.v"
remove_design -force -verilog "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/roi_crop.v"
remove_design -force -verilog "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/ratio_check.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "C:/Users/HHH/Desktop/FPGA_plate/FPGA_plate/source/point.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "C:/Users/HHH/Desktop/FPGA_plate_color_center_success/FPGA_plate_color_center_success/FPGA_plate/source/rgb_ero.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
